
__author__ = 'Ваши Ф.И.О.'

# Задача-1: Дано произвольное целое число (число заранее неизвестно).
# Вывести поочередно цифры исходного числа (порядок вывода цифр неважен).
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании решите задачу с применением цикла for.

# num = int(input('Введите число: '))
# while True:
#     if not num:
#         break
#
#     div = num // 10
#     mod = num % 10
#     num = div
#     print(mod)


# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Подсказка:
# * постарайтесь сделать решение через дополнительную переменную 
#   или через арифметические действия
# Не нужно решать задачу так:
# print("a = ", b, "b = ", a) - это неправильное решение!

# a = int(input('Введите число a = '))
# b = int(input('Введите число b = '))
# a = a + b
# b = a - b
# a = a - b
# print(f'{a=}')
# print(f'{b=}')

# Задача-3: Запросите у пользователя его возраст.
# Если ему есть 18 лет, выведите: "Доступ разрешен",
# иначе "Извините, пользование данным ресурсом только с 18 лет"
# years = int(input('Введите Ваш возраст: '))
# if years >= 18:
#     print('Доступ разрешен')
# else:
#     print('Извините, пользование данным ресурсом только с 18 лет')


